# Введення (отримання даних)
# ім_я = input("Введіть ваше ім'я: ")
#
# # Перетворення (обробка даних)
# вітання = f"Привіт, {ім_я}!"
#
# # Виведення (виведення даних)
# print(вітання)

# a = 3.2 + 2j
# print(type(a))

# message = 'Hello World!'
# print(message[1])

# s1 = 'Hello'
# s2 = "World"
#
# print(s1 + ' ' + s2)

# # # ---------------------------- F - рядок
# name = input('Введіть імʼя ')
# fullname = input('Введіть празвище ')
#
# sum = f"Привіт {name} {fullname}"
#
# print(sum)

### -------------------------